tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86j99_tdd.h
#define AMASK2                        2765
#define AMASK3                        2766
#define CHIME                         2767
#define ALRMEN                        2768
#define RTCVALL                       2769
#define WAITE0                        2770
#define RTCVALH                       2771
#define WAITE1                        2772
#define WAITM0                        2773
#define WAITM1                        2774
#define WAITM2                        2775
#define WAITM3                        2776
#define WAITB0                        2777
#define WAITB1                        2778
#define RTCCAL                        2779
#define CAL0                          2780
#define CAL                           2781
#define CAL1                          2782
#define CAL2                          2783
#define CAL3                          2784
#define CAL4                          2785
#define CAL5                          2786
#define CAL6                          2787
#define CAL7                          2788
#define RTCCON1                       2789
#define RTCPTR0                       2790
#define RTCPTR                        2791
#define RTCPTR1                       2792
#define RTCOE                         2793
#define HALFSEC                       2794
#define RTCSYNC                       2795
#define RTCWREN                       2796
#define RTCEN                         2797
#define DMACON1                       2798
#define DMAEN                         2799
#define DLYINTEN                      2800
#define DUPLEX                        2801
#define DUPLEX0                       2802
#define DUPLEX1                       2803
#define RXINC                         2804
#define TXINC                         2805
#define SSCON                         2806
#define SSCON0                        2807
#define SSCON1                        2808
#define PIE6                          2809
#define CMP1IE                        2810
#define CMP2IE                        2811
#define CMP3IE                        2812
#define TX3IE                         2813
#define RC3IE                         2814
#define TX4IE                         2815
#define RC4IE                         2816
#define WPUB                          2817
#define WPUB0                         2818
#define WPUB1                         2819
#define WPUB2                         2820
#define WPUB3                         2821
#define WPUB4                         2822
#define WPUB5                         2823
#define WPUB6                         2824
#define WPUB7                         2825
#define ACTCON                        2826
#define ACTORSPOL                     2827
#define ACTORS                        2828
#define ACTLOCKPOL                    2829
#define ACTLOCK                       2830
#define ACTSRC                        2831
#define ACTSIDL                       2832
#define ACTEN                         2833
#define OSCCON4                       2834
#define PLLEN                         2835
#define CPDIV0                        2836
#define CPDIV                         2837
#define CPDIV1                        2838
#define OSCCON3                       2839
#define IRCF                          2840
#define IRCF0                         2841
#define IRCF1                         2842
#define IRCF2                         2843
#define OSCCON2                       2844
#define SOSCGO                        2845
#define POSCEN                        2846
#define CF                            2847
#define LOCK                          2848
#define IOLOCK                        2849
#define CLKLOCK                       2850
#define BAUDCON1                      2851
#define BAUDCON1_ABDEN                2852
#define ABDEN1                        2853
#define BAUDCON1_WUE                  2854
#define WUE1                          2855
#define BAUDCON1_IREN                 2856
#define BRG161                        2857
#define BAUDCON1_BRG16                2858
#define CKTXP                         2859
#define BAUDCON1_TXCKP                2860
#define SCKP1                         2861
#define TXCKP1                        2862
#define SCKP                          2863
#define DTRXP1                        2864
#define RXDTP1                        2865
#define DTRXP                         2866
#define RXCKP                         2867
#define BAUDCON1_RXDTP                2868
#define RCMT1                         2869
#define RCIDL1                        2870
#define BAUDCON1_RCIDL                2871
#define RCMT                          2872
#define ABDOVF1                       2873
#define BAUDCON1_ABDOVF               2874
#define SSP1MSK                       2875
#define SSP1MSK_MSK0                  2876
#define SSP1MSK_SSPMSK                2877
#define SSP1MSK_MSK1                  2878
#define SSP1MSK_MSK2                  2879
#define SSP1MSK_MSK3                  2880
#define SSP1MSK_MSK4                  2881
#define SSP1MSK_MSK5                  2882
#define SSP1MSK_MSK6                  2883
#define SSP1MSK_MSK7                  2884
#define SSP1CON3                      2885
#define SSP1CON3_DHEN                 2886
#define SSP1CON3_AHEN                 2887
#define SSP1CON3_SBCDE                2888
#define SSP1CON3_SDAHT                2889
#define SSP1CON3_BOEN                 2890
#define SSP1CON3_SCIE                 2891
#define SSP1CON3_PCIE                 2892
#define SSP1CON3_ACKTIM               2893
#define TXBUF0                        2894
#define TXBUF                         2895
#define TXBUF1                        2896
#define TXBUF2                        2897
#define TXBUF3                        2898
#define TXBUF4                        2899
#define TXBUF5                        2900
#define TXBUF6                        2901
#define TXBUF7                        2902
#define DMABCH                        2903
#define BC8                           2904
#define DMACNTHB                      2905
#define BC9                           2906
#define DMABCL                        2907
#define DMACNTLB                      2908
#define BC0                           2909
#define BC1                           2910
#define BC2                           2911
#define BC3                           2912
#define BC4                           2913
#define BC5                           2914
#define BC6                           2915
#define BC7                           2916
#define RXADDRH                       2917
#define RXADDR8                       2918
#define DMARCVPTRHB                   2919
#define RXADDR9                       2920
#define RXADDR10                      2921
#define RXADDR11                      2922
#define RXADDRL                       2923
#define DMARCVPTRLB                   2924
#define RXADDR0                       2925
#define RXADDR1                       2926
#define RXADDR2                       2927
#define RXADDR3                       2928
#define RXADDR4                       2929
#define RXADDR5                       2930
#define RXADDR6                       2931
#define RXADDR7                       2932
#define TXADDRH                       2933
#define TXADDR8                       2934
#define DMATXPTRHB                    2935
#define TXADDR9                       2936
#define TXADDR10                      2937
#define TXADDR11                      2938
#define TXADDRL                       2939
#define DMATXPTRLB                    2940
#define TXADDR0                       2941
#define TXADDR1                       2942
#define TXADDR2                       2943
#define TXADDR3                       2944
#define TXADDR4                       2945
#define TXADDR5                       2946
#define TXADDR6                       2947
#define TXADDR7                       2948
#define PORTVP                        2949
#define RVP0                          2950
#define RVP1                          2951
#define RVP2                          2952
#define RVP3                          2953
#define RVP4                          2954
#define RVP5                          2955
#define RVP6                          2956
#define RVP7                          2957
#define LATVP                         2958
#define LATVP0                        2959
#define LATVP1                        2960
#define LATVP2                        2961
#define LATVP3                        2962
#define LATVP4                        2963
#define LATVP5                        2964
#define LATVP6                        2965
#define LATVP7                        2966
#define TRISVP                        2967
#define TRISVP0                       2968
#define TRISVP1                       2969
#define TRISVP2                       2970
#define TRISVP3                       2971
#define TRISVP4                       2972
#define TRISVP5                       2973
#define TRISVP6                       2974
#define TRISVP7                       2975
#define UADDR                         2976
#define ADDR                          2977
#define ADDR0                         2978
#define ADDR1                         2979
#define ADDR2                         2980
#define ADDR3                         2981
#define ADDR4                         2982
#define ADDR5                         2983
#define ADDR6                         2984
#define UCON                          2985
#define SUSPND                        2986
#define RESUME                        2987
#define USBEN                         2988
#define PKTDIS                        2989
#define SE0                           2990
#define PPBRST                        2991
#define USTAT                         2992
#define PPBI                          2993
#define DIR                           2994
#define ENDP                          2995
#define ENDP0                         2996
#define ENDP1                         2997
#define ENDP2                         2998
#define ENDP3                         2999
#define UEIR                          3000
#define PIDEF                         3001
#define CRC5EF                        3002
#define CRC16EF                       3003
#define DFN8EF                        3004
#define BTOEF                         3005
#define BTSEF                         3006
#define UIR                           3007
#define URSTIF                        3008
#define UERRIF                        3009
#define ACTVIF                        3010
#define TRNIF                         3011
#define IDLEIF                        3012
#define STALLIF                       3013
#define SOFIF                         3014
#define UFRMH                         3015
#define FRM8                          3016
#define UFRMH_FRM                     3017
#define FRM9                          3018
#define FRM10                         3019
#define UFRML                         3020
#define FRML                          3021
#define FRM0                          3022
#define UFRML_FRM                     3023
#define FRM1                          3024
#define FRM2                          3025
#define FRM3                          3026
#define FRM4                          3027
#define FRM5                          3028
#define FRM6                          3029
#define FRM7                          3030
#define RCON4                         3031
#define PMSLP                         3032
#define DPSLP                         3033
#define SRETEN                        3034
#define RCON3                         3035
#define VBAT                          3036
#define VBPOR                         3037
#define VDDPOR                        3038
#define VDDBOR                        3039
#define STKERR                        3040
#define RCON2                         3041
#define SWDTEN                        3042
#define EXTR                          3043
#define EECON2                        3044
#define EECON1                        3045
#define WR                            3046
#define WREN                          3047
#define WRERR                         3048
#define FREE                          3049
#define WWPROG                        3050
#define PORTA                         3051
#define ULPWUIN                       3052
#define RA0                           3053
#define RA1                           3054
#define RA2                           3055
#define RA3                           3056
#define RA4                           3057
#define LVDIN                         3058
#define RA5                           3059
#define RA6                           3060
#define PORTA_RJPU                    3061
#define RA7                           3062
#define PORTB                         3063
#define RB0                           3064
#define RB1                           3065
#define RB2                           3066
#define CCP2_PA2                      3067
#define RB3                           3068
#define RB4                           3069
#define RB5                           3070
#define RB6                           3071
#define RB7                           3072
#define PORTC                         3073
#define RC0                           3074
#define PA2                           3075
#define RC1                           3076
#define CCP2                          3077
#define PA1                           3078
#define RC2                           3079
#define RC3                           3080
#define RC4                           3081
#define RC5                           3082
#define RC6                           3083
#define RC7                           3084
#define PORTD                         3085
#define RD0                           3086
#define RD1                           3087
#define RD2                           3088
#define RD3                           3089
#define RD4                           3090
#define RD5                           3091
#define RD6                           3092
#define RD7                           3093
#define SS2                           3094
#define PORTE                         3095
#define PD2                           3096
#define RDE                           3097
#define RE0                           3098
#define WRE                           3099
#define RE1                           3100
#define PC2                           3101
#define PORTE_CS                      3102
#define CCP10                         3103
#define PB2                           3104
#define RE2                           3105
#define CCP9E                         3106
#define RE3                           3107
#define PC3E                          3108
#define PB3E                          3109
#define RE4                           3110
#define CCP8E                         3111
#define CCP7E                         3112
#define RE5                           3113
#define PC1E                          3114
#define CCP6E                         3115
#define RE6                           3116
#define PB1E                          3117
#define CCP2E                         3118
#define PA2E                          3119
#define RE7                           3120
#define PORTF                         3121
#define RF2                           3122
#define C1OUTF                        3123
#define RF3                           3124
#define RF4                           3125
#define RF5                           3126
#define RF6                           3127
#define RF7                           3128
#define PORTG                         3129
#define RG0                           3130
#define RG1                           3131
#define C3OUTG                        3132
#define RG2                           3133
#define RG3                           3134
#define RG4                           3135
#define PORTH                         3136
#define RH0                           3137
#define RH1                           3138
#define RH2                           3139
#define RH3                           3140
#define RH4                           3141
#define CCP9                          3142
#define PC3                           3143
#define PB3                           3144
#define RH5                           3145
#define CCP8                          3146
#define PC1                           3147
#define RH6                           3148
#define CCP7                          3149
#define PB1                           3150
#define RH7                           3151
#define CCP6                          3152
#define PORTJ                         3153
#define RJ0                           3154
#define RJ1                           3155
#define RJ2                           3156
#define RJ3                           3157
#define RJ4                           3158
#define RJ5                           3159
#define RJ6                           3160
#define RJ7                           3161
#define LATA                          3162
#define LATA0                         3163
#define LA0                           3164
#define LATA1                         3165
#define LA1                           3166
#define LATA2                         3167
#define LA2                           3168
#define LATA3                         3169
#define LA3                           3170
#define LATA4                         3171
#define LA4                           3172
#define LATA5                         3173
#define LA5                           3174
#define LATA6                         3175
#define LA6                           3176
#define LATA7                         3177
#define LA7                           3178
#define LATB                          3179
#define LB0                           3180
#define LATB0                         3181
#define LB1                           3182
#define LATB1                         3183
#define LB2                           3184
#define LATB2                         3185
#define LB3                           3186
#define LATB3                         3187
#define LB4                           3188
#define LATB4                         3189
#define LB5                           3190
#define LATB5                         3191
#define LB6                           3192
#define LATB6                         3193
#define LB7                           3194
#define LATB7                         3195
#define LATC                          3196
#define LATC0                         3197
#define LC0                           3198
#define LATC1                         3199
#define LC1                           3200
#define LATC2                         3201
#define LC2                           3202
#define LATC3                         3203
#define LC3                           3204
#define LATC4                         3205
#define LC4                           3206
#define LATC5                         3207
#define LC5                           3208
#define LATC6                         3209
#define LC6                           3210
#define LATC7                         3211
#define LC7                           3212
#define LATD                          3213
#define LATD0                         3214
#define LD0                           3215
#define LATD1                         3216
#define LD1                           3217
#define LATD2                         3218
#define LD2                           3219
#define LATD3                         3220
#define LD3                           3221
#define LATD4                         3222
#define LD4                           3223
#define LATD5                         3224
#define LD5                           3225
#define LATD6                         3226
#define LD6                           3227
#define LATD7                         3228
#define LD7                           3229
#define LATE                          3230
#define LATE0                         3231
#define LE0                           3232
#define LATE1                         3233
#define LE1                           3234
#define LATE2                         3235
#define LE2                           3236
#define LATE3                         3237
#define LE3                           3238
#define LATE4                         3239
#define LE4                           3240
#define LATE5                         3241
#define LE5                           3242
#define LATE6                         3243
#define LE6                           3244
#define LATE7                         3245
#define LE7                           3246
#define LATF                          3247
#define LF2                           3248
#define LATF2                         3249
#define LF3                           3250
#define LATF3                         3251
#define LF4                           3252
#define LATF4                         3253
#define LF5                           3254
#define LATF5                         3255
#define LF6                           3256
#define LATF6                         3257
#define LF7                           3258
#define LATF7                         3259
#define LATG                          3260
#define LATG0                         3261
#define LG0                           3262
#define LATG1                         3263
#define LG1                           3264
#define LATG2                         3265
#define LG2                           3266
#define LATG3                         3267
#define LG3                           3268
#define LATG4                         3269
#define LG4                           3270
#define LATH                          3271
#define LH0                           3272
#define LATH0                         3273
#define LH1                           3274
#define LATH1                         3275
#define LH2                           3276
#define LATH2                         3277
#define LH3                           3278
#define LATH3                         3279
#define LH4                           3280
#define LATH4                         3281
#define LH5                           3282
#define LATH5                         3283
#define LH6                           3284
#define LATH6                         3285
#define LH7                           3286
#define LATH7                         3287
#define LATJ                          3288
#define LATJ0                         3289
#define LJ0                           3290
#define LATJ1                         3291
#define LJ1                           3292
#define LATJ2                         3293
#define LJ2                           3294
#define LATJ3                         3295
#define LJ3                           3296
#define LATJ4                         3297
#define LJ4                           3298
#define LATJ5                         3299
#define LJ5                           3300
#define LATJ6                         3301
#define LJ6                           3302
#define LATJ7                         3303
#define LJ7                           3304
#define TRISA                         3305
#define TRISA0                        3306
#define TRISA1                        3307
#define TRISA2                        3308
#define TRISA3                        3309
#define TRISA4                        3310
#define TRISA5                        3311
#define TRISA6                        3312
#define TRISA7                        3313
#define TRISB                         3314
#define TRISB0                        3315
#define TRISB1                        3316
#define TRISB2                        3317
#define TRISB3                        3318
#define TRISB4                        3319
#define TRISB5                        3320
#define TRISB6                        3321
#define TRISB7                        3322
