tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86j99_tdd.h
#define nCM                           3881
#define IPEN                          3882
#define IOCF                          3883
#define IOCF0                         3884
#define IOCF1                         3885
#define IOCF2                         3886
#define IOCF3                         3887
#define IOCF4                         3888
#define IOCF5                         3889
#define IOCF6                         3890
#define IOCF7                         3891
#define IPR5                          3892
#define CCH05                         3893
#define TMR4IP                        3894
#define CCH15                         3895
#define TMR5IP                        3896
#define TMR6IP                        3897
#define EVPOL15                       3898
#define TMR8IP                        3899
#define ACTLOCKIP                     3900
#define ACTORSIP                      3901
#define OSCCON                        3902
#define NOSC0                         3903
#define NOSC                          3904
#define SCS                           3905
#define NOSC1                         3906
#define NOSC2                         3907
#define COSC                          3908
#define COSC0                         3909
#define COSC1                         3910
#define COSC2                         3911
#define IDLEN                         3912
#define T0CON                         3913
#define T0PS                          3914
#define T0PS0                         3915
#define T0PS1                         3916
#define T0PS2                         3917
#define PSA                           3918
#define T0CS                          3919
#define T0CS0                         3920
#define T0CS1                         3921
#define T08BIT                        3922
#define TMR0ON                        3923
#define TMR0L                         3924
#define TMR0H                         3925
#define STATUS                        3926
#define C                             3927
#define CARRY                         3928
#define DC                            3929
#define ZERO                          3930
#define Z                             3931
#define OV                            3932
#define OVERFLOW                      3933
#define N                             3934
#define NEGATIVE                      3935
#define FSR2L                         3936
#define PLUSW2                        3937
#define PREINC2                       3938
#define POSTDEC2                      3939
#define POSTINC2                      3940
#define INDF2                         3941
#define FSR1L                         3942
#define PLUSW1                        3943
#define PREINC1                       3944
#define POSTDEC1                      3945
#define POSTINC1                      3946
#define INDF1                         3947
#define WREG                          3948
#define FSR0L                         3949
#define PLUSW0                        3950
#define PREINC0                       3951
#define POSTDEC0                      3952
#define POSTINC0                      3953
#define INDF0                         3954
#define INTCON3                       3955
#define INT1IF                        3956
#define INT1F                         3957
#define INT2IF                        3958
#define INT2F                         3959
#define INT3F                         3960
#define INT3IF                        3961
#define INT1E                         3962
#define INT1IE                        3963
#define INT2IE                        3964
#define INT2E                         3965
#define INT3E                         3966
#define INT3IE                        3967
#define INT1P                         3968
#define INT1IP                        3969
#define INT2IP                        3970
#define INT2P                         3971
#define INTCON2                       3972
#define IOCIP                         3973
#define INT3IP                        3974
#define INT3P                         3975
#define TMR0IP                        3976
#define T0IP                          3977
#define INTEDG3                       3978
#define INTEDG2                       3979
#define INTEDG1                       3980
#define INTEDG0                       3981
#define NOT_RBPU                      3982
#define RBPU                          3983
#define nRBPU                         3984
#define INTCON                        3985
#define IOCIF                         3986
#define INT0F                         3987
#define INT0IF                        3988
#define T0IF                          3989
#define TMR0IF                        3990
#define IOCIE                         3991
#define INT0E                         3992
#define INT0IE                        3993
#define T0IE                          3994
#define TMR0IE                        3995
#define PEIE                          3996
#define PEIE_GIEL                     3997
#define GIEL                          3998
#define GIEH                          3999
#define GIE_GIEH                      4000
#define GIE                           4001
#define PRODL                         4002
#define PRODH                         4003
#define TABLAT                        4004
#define TBLPTRL                       4005
#define TBLPTRH                       4006
#define PCL                           4007
#define PCLATH                        4008
#define PCH                           4009
#define SP0                           4010
#define STKPTR                        4011
#define SP1                           4012
#define SP2                           4013
#define SP3                           4014
#define SP4                           4015
#define STKUNF                        4016
#define STKOVF                        4017
#define STKFUL                        4018
#define TOSL                          4019
#define TOSH                          4020

#endif // _PIC18F86J99_H_
